using System.Collections.Specialized;

namespace Core
{
    /// <summary>
    /// 原始的元数据（还未分割）
    /// </summary>
    class RawMetadata
    {
        /// <summary>
        /// 字母元数据
        /// </summary>
        public static NameValueCollection metadataAlpha { get; private set; }
        /// <summary>
        /// 数字元数据
        /// </summary>
        public static NameValueCollection metadataNumber { get; private set; }

        static RawMetadata()
        {
            //从metadataAlpha中，可以提取a b c d e f i j l n o r s t u 15个字符以及空格
            //其余字符保留原字符
            metadataAlpha = new NameValueCollection() 
            {
                {"false","!~+[]"},
                {"false","!!+[]"},
                {"true","!+[]"},
                //{"true","!~~+[]"},
                {"[object Object]","({}+[])"},
                {"[object Object]","([]+{})"},
                {"undefined","[][--[~+''][+[]]*[~+[]]+~~!+[]]"},
                //{"undefined","[{}][--[~+''][+[]]*[~+[]]+~~!+[]+(~+[]*~+[])]"}
            };
            //从metadataNumber可以提取数字
            metadataNumber = new NameValueCollection() 
            {
                {"0","+[]"},
                //{"0","~~+[]"},
                {"1","~~!+[]"},
                //{"1","~+[]*~+[]"},
                {"2","+[]-~!+[]"},
                //{"2","~!+[]*~+[]"},
                {"3","~~!+[]+ +[]-~!+[]"},
                //{"3","~+[]*~+[] +~!+[]*~+[]"},
                //{"4","~~!+[]+~~!+[]+ +[]-~!+[]"},
                {"4","+[]-~!+[]+ +[]-~!+[]"},
                {"5","+[]-~!+[]+~~!+[]+ +[]-~!+[]"},
                //{"5","~~!+[]+~+[]*~+[]+~~!+[]+~+[]*~+[]+~+[]*~+[]"},
                {"6","~~!+[]+ +[]-~!+[]+~~!+[]+ +[]-~!+[]"},
                //{"6","(+[]-(~!+[]))+(~+[]*~+[])+(+[]-(~!+[])+~~!+[])"},
                {"7","~~!+[]+ +[]-~!+[]+ +[]-~!+[]+ +[]-~!+[]"},
                //{"7","~~!+[]+~+[]*~+[]+~~!+[]+~~!+[]+~+[]*~+[]+~~!+[]+~+[]*~+[]"},
                {"8","+[]-~!+[]+ +[]-~!+[]+ +[]-~!+[]+ +[]-~!+[]"},
                //{"8","~~!+[]+~+[]*~+[]+~~!+[]+~+[]*~+[]+(+[]-(~!+[])+(~!+[])*(~+[]))"},
                //{"9","(+[]-(~!+[]))+(+[]-(~!+[])+(~!+[])*(~+[]))+(~~!+[]+~+[]*~+[]+~~!+[])"},
                {"9","+[]-~!+[]+ +[]-~!+[]+ +[]-~!+[]+~~!+[]+ +[]-~!+[]"}
            };
        }
    }
}
